# Exploratory Data Analysis - AGM's Products

AGM sells 8 different types of ready-made meals.

In [1]:
# Import necessary packages
import math
import numpy as np
import pandas as pd
import psycopg2
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):
    '''This function will run a selected query in Postgres and 
    return the rows in a pandas dataframe'''
    
    if rollback_before_flag:
        connection.rollback()
    
    df = pd.read_sql_query(query, connection)
    
    if rollback_after_flag:
        connection.rollback()
    
    # Below converts float columns that integer columns, for those that should be integer columns.
    for column in df:
    
        if df[column].dtype == "float64":

            fraction_flag = False

            for value in df[column].values:
                
                if not np.isnan(value):
                    if value - math.floor(value) != 0:
                        fraction_flag = True

            if not fraction_flag:
                df[column] = df[column].astype('Int64')
    
    return(df)

connection = psycopg2.connect(
    user = "postgres",
    password = "ucb",
    host = "postgres",
    port = "5432",
    database = "postgres"
)

cursor = connection.cursor()

### Total Meals Purchased

In [3]:
rollback_before_flag = True
rollback_after_flag = True

query = """
select sum(line_items.quantity) as total_meals_purchased
from line_items
"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_meals_purchased
0                8228284

### Total Meals Purchased, by Meal

In [4]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select products.description, sum(line_items.quantity) as total_meals_purchased
from line_items
     join products
          on line_items.product_id = products.product_id
group by products.description
order by products.description asc
"""

df3 = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df3

         description  total_meals_purchased
0  Brocolli Stir Fry                 913984
1      Chicken Salad                 228561
2      Curry Chicken                1368884
3   Eggplant Lasagna                1599058
4   Pistachio Salmon                1828778
5       Spinach Orzo                 456769
6   Teriyaki Chicken                1145013
7    Tilapia Piccata                 687237

### Total Meals Purchased, by Meal and Store

In [5]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select stores.city, products.description, sum(line_items.quantity) as total_meals_purchased
from line_items
     join products
          on line_items.product_id = products.product_id
     join stores
          on line_items.store_id = stores.store_id       
group by stores.city, products.description
order by stores.city asc, products.description asc
"""

df_3 = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df_3

         city        description  total_meals_purchased
0    Berkeley  Brocolli Stir Fry                 232038
1    Berkeley      Chicken Salad                  57719
2    Berkeley      Curry Chicken                 346508
3    Berkeley   Eggplant Lasagna                 405637
4    Berkeley   Pistachio Salmon                 464274
5    Berkeley       Spinach Orzo                 115469
6    Berkeley   Teriyaki Chicken                 290858
7    Berkeley    Tilapia Piccata                 174252
8      Dallas  Brocolli Stir Fry                 179885
9      Dallas      Chicken Salad                  44756
10     Dallas      Curry Chicken                 269689
11     Dallas   Eggplant Lasagna                 314383
12     Dallas   Pistachio Salmon                 359615
13     Dallas       Spinach Orzo                  89644
14     Dallas   Teriyaki Chicken                 224932
15     Dallas    Tilapia Piccata                 134451
16      Miami  Brocolli Stir Fry                 164027
17      Miami      Chicken Salad                  41005
18      Miami      Curry Chicken                 244719
19      Miami   Eggplant Lasagna                 286676
20      Miami   Pistachio Salmon                 327613
21      Miami       Spinach Orzo                  82047
22      Miami   Teriyaki Chicken                 204953
23      Miami    Tilapia Piccata                 123327
24  Nashville  Brocolli Stir Fry                 134805
25  Nashville      Chicken Salad                  33939
26  Nashville      Curry Chicken                 202178
27  Nashville   Eggplant Lasagna                 235703
28  Nashville   Pistachio Salmon                 269694
29  Nashville       Spinach Orzo                  67689
30  Nashville   Teriyaki Chicken                 168664
31  Nashville    Tilapia Piccata                 101759
32    Seattle  Brocolli Stir Fry                 203229
33    Seattle      Chicken Salad                  51142
34    Seattle      Curry Chicken                 305790
35    Seattle   Eggplant Lasagna                 356659
36    Seattle   Pistachio Salmon                 407582
37    Seattle       Spinach Orzo                 101920
38    Seattle   Teriyaki Chicken                 255606
39    Seattle    Tilapia Piccata                 153448

### Total Meals Purchased, by Month

In [33]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select extract(month from sales.sale_date) as month_number,to_char(sales.sale_date, 'Month') as month, sum(line_items.quantity) as total_meals_purchased
from line_items
join sales 
     on line_items.sale_id = sales.sale_id
group by month_number, month
order by month_number, month
"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

    month_number      month  total_meals_purchased
0              1  January                  3252637
1              2  February                 3152564
2              3  March                    3660355
3              4  April                    3435052
4              5  May                      3330027
5              6  June                     3380074
6              7  July                     3326135
7              8  August                   3591531
8              9  September                2785597
9             10  October                  2876508
10            11  November                 2241121
11            12  December                 1912426

### Total Meals Purchased, by Month and Meal

In [6]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select extract(month from sales.sale_date) as month_number,
       to_char(sales.sale_date, 'Month') as month,products.description, sum(line_items.quantity) as total_meals_purchased
from line_items
join sales 
     on line_items.sale_id = sales.sale_id
join products
     on line_items.product_id = products.product_id
group by month_number, month, products.description
order by month_number, month, products.description asc
"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

    month_number      month        description  total_meals_purchased
0              1  January    Brocolli Stir Fry                 360924
1              1  January        Chicken Salad                  90123
2              1  January        Curry Chicken                 541187
3              1  January     Eggplant Lasagna                 631818
4              1  January     Pistachio Salmon                 720970
..           ...        ...                ...                    ...
91            12  December    Eggplant Lasagna                 371340
92            12  December    Pistachio Salmon                 425360
93            12  December        Spinach Orzo                 105496
94            12  December    Teriyaki Chicken                 266347
95            12  December     Tilapia Piccata                 159516

[96 rows x 4 columns]

### Total Meals Purchased, by Day of Week and Meal

In [7]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select extract(dow from sales.sale_date) as dow,
       to_char(sales.sale_date, 'Day') as day_of_week, products.description, sum(line_items.quantity) as total_meals_purchased
from line_items
join sales 
     on line_items.sale_id = sales.sale_id
join products
     on line_items.product_id = products.product_id
group by dow, day_of_week, products.description
order by dow, day_of_week, products.description asc
"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

    dow day_of_week        description  total_meals_purchased
0     0   Sunday     Brocolli Stir Fry                 767460
1     0   Sunday         Chicken Salad                 192077
2     0   Sunday         Curry Chicken                1149614
3     0   Sunday      Eggplant Lasagna                1343248
4     0   Sunday      Pistachio Salmon                1537853
5     0   Sunday          Spinach Orzo                 383486
6     0   Sunday      Teriyaki Chicken                 961561
7     0   Sunday       Tilapia Piccata                 577641
8     1   Monday     Brocolli Stir Fry                 545188
9     1   Monday         Chicken Salad                 136507
10    1   Monday         Curry Chicken                 815888
11    1   Monday      Eggplant Lasagna                 950729
12    1   Monday      Pistachio Salmon                1090324
13    1   Monday          Spinach Orzo                 272010
14    1   Monday      Teriyaki Chicken                 681053
15    1   Monday       Tilapia Piccata                 409241
16    2   Tuesday    Brocolli Stir Fry                 286054
17    2   Tuesday        Chicken Salad                  71660
18    2   Tuesday        Curry Chicken                 428937
19    2   Tuesday     Eggplant Lasagna                 501416
20    2   Tuesday     Pistachio Salmon                 573182
21    2   Tuesday         Spinach Orzo                 142995
22    2   Tuesday     Teriyaki Chicken                 358973
23    2   Tuesday      Tilapia Piccata                 215558
24    3   Wednesday  Brocolli Stir Fry                 580193
25    3   Wednesday      Chicken Salad                 144416
26    3   Wednesday      Curry Chicken                 869434
27    3   Wednesday   Eggplant Lasagna                1015904
28    3   Wednesday   Pistachio Salmon                1161618
29    3   Wednesday       Spinach Orzo                 291589
30    3   Wednesday   Teriyaki Chicken                 727361
31    3   Wednesday    Tilapia Piccata                 435734
32    4   Thursday   Brocolli Stir Fry                 578419
33    4   Thursday       Chicken Salad                 144709
34    4   Thursday       Curry Chicken                 865293
35    4   Thursday    Eggplant Lasagna                1011092
36    4   Thursday    Pistachio Salmon                1156529
37    4   Thursday        Spinach Orzo                 288940
38    4   Thursday    Teriyaki Chicken                 724448
39    4   Thursday     Tilapia Piccata                 434550
40    5   Friday     Brocolli Stir Fry                 541101
41    5   Friday         Chicken Salad                 134837
42    5   Friday         Curry Chicken                 810415
43    5   Friday      Eggplant Lasagna                 946838
44    5   Friday      Pistachio Salmon                1081745
45    5   Friday          Spinach Orzo                 270210
46    5   Friday      Teriyaki Chicken                 678247
47    5   Friday       Tilapia Piccata                 406872
48    6   Saturday   Brocolli Stir Fry                 804787
49    6   Saturday       Chicken Salad                 202267
50    6   Saturday       Curry Chicken                1205401
51    6   Saturday    Eggplant Lasagna                1409826
52    6   Saturday    Pistachio Salmon                1611128
53    6   Saturday        Spinach Orzo                 402900
54    6   Saturday    Teriyaki Chicken                1008494
55    6   Saturday     Tilapia Piccata                 606075

### Average Meals Purchased Per Sale

In [8]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select sum(line_items.quantity)/count(line_items.sale_id) as avg_meals_overall
from line_items
"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   avg_meals_overall
0           1.518701

### Average Meals Per Sale, by Store

In [9]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select stores.city, sum(line_items.quantity)/count(sales.sale_id) as avg_meals_overall
from line_items
     join stores
          on line_items.store_id = stores.store_id
     join sales
          on line_items.sale_id = sales.sale_id
group by stores.city
order by stores.city asc

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

        city  avg_meals_overall
0   Berkeley           1.517387
1     Dallas           1.520470
2      Miami           1.519812
3  Nashville           1.515977
4    Seattle           1.519675